:PROPERTIES:
:ID:       fbd8ad5a-7936-43c9-9155-1456cde0cfe4
:END:
#+title: index
#+STARTUP: showall hideblocks
#+date: 2023-08-30

Esta es mi base de conocimiento generada gracias a Org-Roam. Todo en una carpeta con archivos de texto en Org-mode.

* [[id:192ac837-de8f-4dbb-a294-2d0ff360184f][Lenguajes de programación]]                           :code:
* [[id:ccb379dd-3d92-4290-9fbd-5e56606da7bc][Linux]]                                              :linux:
* [[id:9c1e38a5-2c38-4370-b483-f637457686d4][Aplicaciones]]                                        :apps:
* [[id:95515039-0726-44b0-a140-2d60edcff021][Hardware]]
* [[id:efa93d01-3a2a-4286-85c2-47bbfb633670][projects]]                                         :project:

* --------------------------------------------------

* Org-Roam tips
- Tags a un nodo ~#+filetags: :proyecto:urgente:trabajo:~
- Tags a un encabezado ~C-c C-q~
- Encabezados, visualización ~#+STARTUP: overview/content/showall~


#+begin_src elisp :results value
(mapcar #'car (org-roam-db-query [:select :distinct [tag] :from tags]))
#+end_src

#+RESULTS:
| hardware | SO | linux | mint | apps | code | emacs | so | prompt | pdf | json | project |
